In [1]:
import pandas as pd
import numpy as np
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine

In [2]:
df = pd.read_csv('Data/title_basics.csv.gz')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79386 entries, 0 to 79385
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          79386 non-null  object
 1   titleType       79386 non-null  object
 2   primaryTitle    79386 non-null  object
 3   originalTitle   79386 non-null  object
 4   isAdult         79386 non-null  int64
 5   startYear       79386 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  79386 non-null  int64
 8   genres          79386 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 5.5+ MB

In [3]:
df['genres_split'] = df['genres'].str.split(',')
df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"
...,...,...,...,...,...,...,...,...,...,...
79381,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
79382,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
79383,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
79384,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
79385,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [4]:
genres_split = df['genres'].str.split(',')
exploded_genres = df.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
79384,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Action
79384,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Adventure
79384,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Thriller
79385,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
79385,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [5]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [6]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [7]:
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [8]:
df['genre_id'] = df['genres_split'].replace(genre_id_map)
df['genre_id']

0           [Comedy, Fantasy, Romance]
1                              [Drama]
2                              [Drama]
3             [Comedy, Horror, Sci-Fi]
4            [Horror, Music, Thriller]
                     ...
79381                          [Drama]
79382         [Comedy, Drama, Fantasy]
79383                          [Drama]
79384    [Action, Adventure, Thriller]
79385                 [Drama, History]
Name: genre_id, Length: 79386, dtype: object

In [9]:
genres = pd.DataFrame({'Genre_Name': genre_id_map.keys(),
                            'Genre_ID':genre_id_map.values()})
genres

    Genre_Name  Genre_ID
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Short        20
21       Sport        21
22   Talk-Show        22
23    Thriller        23
24         War        24
25     Western        25

In [10]:
title_basics = df.drop(columns = ['originalTitle', 'isAdult', 'titleType', 'genres_split', 'genre_id'], axis = 1)
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79386 entries, 0 to 79385
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          79386 non-null  object
 1   primaryTitle    79386 non-null  object
 2   startYear       79386 non-null  int64
 3   endYear         0 non-null      float64
 4   runtimeMinutes  79386 non-null  int64
 5   genres          79386 non-null  object
dtypes: float64(1), int64(2), object(3)
memory usage: 3.6+ MB

In [11]:
from sqlalchemy.types import *
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
title_basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [12]:
username='root'
password='TuffyBrunoFreya1998!'

In [13]:
connection = f"mysql+pymysql://{username}:{password}@localhost/movies"
engine = create_engine(connection)

In [14]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created.')

It exists!

In [15]:
title_basics.to_sql('title_basics',engine,dtype=title_basics_schema,if_exists='replace',index=False)
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [16]:
title_ratings = pd.read_csv("Data/title.ratings.tsv.gz")
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1253226 entries, 0 to 1253225
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1253226 non-null  object
 1   averageRating  1253226 non-null  float64
 2   numVotes       1253226 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.7+ MB

In [17]:
key_len_ratings = title_ratings['tconst'].fillna('').map(len).max()
title_ratings_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [18]:
title_ratings.to_sql('title_ratings',engine,dtype=title_ratings_schema,if_exists='replace',index=False)

In [19]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148466 entries, 0 to 79385
Data columns (total 2 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   tconst        148466 non-null  object
 1   genres_split  148466 non-null  object
dtypes: object(2)
memory usage: 3.4+ MB

In [20]:
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [21]:
key_len_genres = title_genres['tconst'].fillna('').map(len).max()
title_gen = title_genres['genres_split'].fillna('').map(len).max()
title_genres_schema = {
    "tconst": String(key_len+1), 
    'genres_split':Text(title_len+1)}

In [22]:
title_genres.to_sql('title_genres',engine,dtype=title_genres_schema,if_exists='replace',index=False)

In [23]:
genres

    Genre_Name  Genre_ID
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Short        20
21       Sport        21
22   Talk-Show        22
23    Thriller        23
24         War        24
25     Western        25

In [24]:
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Genre_Name  26 non-null     object
 1   Genre_ID    26 non-null     int64
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

In [25]:
key_len_genres1 = genres['Genre_Name'].fillna('').map(len).max()
genres_schema = {
    "Genre_Name": String(key_len+1), 
    'Genre_ID':Integer()}

In [26]:
genres.to_sql('genres',engine,dtype=genres_schema,if_exists='replace',index=False)

In [27]:
df1 = pd.read_csv('Data/final_tmdb_data_2000.csv.gz')
df2 = pd.read_csv('Data/final_tmdb_data_2001.csv.gz')
tmdb = pd.concat([df1, df2])

In [28]:
tmdb.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2479 entries, 0 to 1280
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2479 non-null   object
 1   adult                  2477 non-null   float64
 2   backdrop_path          1256 non-null   object
 3   belongs_to_collection  194 non-null    object
 4   budget                 2477 non-null   float64
 5   genres                 2477 non-null   object
 6   homepage               173 non-null    object
 7   id                     2477 non-null   float64
 8   original_language      2477 non-null   object
 9   original_title         2477 non-null   object
 10  overview               2424 non-null   object
 11  popularity             2477 non-null   float64
 12  poster_path            2174 non-null   object
 13  production_companies   2477 non-null   object
 14  production_countries   2477 non-null   object
 15  release_date           2458 non-null   object
 16  revenue                2477 non-null   float64
 17  runtime                2436 non-null   float64
 18  spoken_languages       2477 non-null   object
 19  status                 2477 non-null   object
 20  tagline                1024 non-null   object
 21  title                  2477 non-null   object
 22  video                  2477 non-null   float64
 23  vote_average           2477 non-null   float64
 24  vote_count             2477 non-null   float64
 25  certification          786 non-null    object
dtypes: float64(9), object(17)
memory usage: 522.9+ KB

In [29]:
tmdb = tmdb.drop(columns = ['backdrop_path', 'belongs_to_collection', 'homepage', 'original_language', 'original_title', 'overview', 'poster_path', 'production_companies', 'production_countries', 'release_date', 'spoken_languages', 'status', 'tagline', ])

In [30]:
tmdb.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2479 entries, 0 to 1280
Data columns (total 13 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2479 non-null   object
 1   adult          2477 non-null   float64
 2   budget         2477 non-null   float64
 3   genres         2477 non-null   object
 4   id             2477 non-null   float64
 5   popularity     2477 non-null   float64
 6   revenue        2477 non-null   float64
 7   runtime        2436 non-null   float64
 8   title          2477 non-null   object
 9   video          2477 non-null   float64
 10  vote_average   2477 non-null   float64
 11  vote_count     2477 non-null   float64
 12  certification  786 non-null    object
dtypes: float64(9), object(4)
memory usage: 271.1+ KB

In [34]:
id_len = tmdb['imdb_id'].fillna('').map(len).max()
genres = tmdb['genres'].fillna('').map(len).max()
title = tmdb['title'].fillna('').map(len).max()
cert = tmdb['certification'].fillna('').map(len).max()

tmdb_data_schema = {
    "imdb_id": String(id_len+1), 
    "genres": String(genres+1),
    'title':String(title+1),
    'certification':String(cert+1),
    'adult':Float(),
    'budget':Float(),
    'id': Float(),
    'popularity': Float(),
    'revenue': Float(),
    'runtime': Float(),
    'video': Float(),
    'vote_average': Float(),
    'vote_count': Float()}

In [36]:
tmdb.to_sql('tmdb_data',engine,dtype=genres_schema,if_exists='replace',index=False)

In [37]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

In [44]:
q = """SELECT * 
FROM genres
LIMIT 3;"""
pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2

In [45]:
w = """SELECT * 
FROM title_basics
LIMIT 3;"""
pd.read_sql(w, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,None,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70,Drama
2,tt0069049,The Other Side of the Wind,2018.0,None,122,Drama

In [46]:
w = """SELECT * 
FROM title_genres
LIMIT 3;"""
pd.read_sql(w, engine)

      tconst genres_split
0  tt0035423       Comedy
1  tt0035423      Fantasy
2  tt0035423      Romance

In [47]:
w = """SELECT * 
FROM title_ratings
LIMIT 3;"""
pd.read_sql(w, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1888
1  tt0000002            5.9       250
2  tt0000003            6.5      1677

In [49]:
w = """SELECT * 
FROM tmdb_data
LIMIT 4;"""
pd.read_sql(w, engine)

,imdb_id,adult,budget,genres,id,popularity,revenue,runtime,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,None,NaN,NaN,NaN,NaN,None,NaN,NaN,NaN,None
1,tt0113026,0.0,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",62127.0,3.343,0.0,86.0,The Fantasticks,0.0,5.5,22.0,None
2,tt0113092,0.0,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",110977.0,2.764,0.0,100.0,For the Cause,0.0,4.4,7.0,None
3,tt0116391,0.0,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",442869.0,1.165,0.0,152.0,Gang,0.0,0.0,0.0,None